# Pandas 

Pandas is of the most important package which can be used for data analysis. It creates mainly two types of data : Series and Dataframe. A pandas dataframe like an excel spreadsheet that is storing some data. One column can have employee name, one column can have employee salary, another column can have age ... Then the rows could be individual employee detail.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type. In a dataframe each column can have its own datatype.

That's not to say numpy arrays aren't useful. It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

**Website**

https://pandas.pydata.org/

**Install**

pip install pandas

## Import libraries

In [1]:
import pandas as pd
import numpy as np # numpy is not necessary , but we will be using some numpy code in this example

## Series

In [2]:
# We will create create which can be considered as a single column of the csv or xcel file.

# Creating a array first
my_list =[5.4,1.2,5,6.3,7.8]
my_array = np.array(my_list)

# Creating a series from this array or list

series_from_list = pd.Series(my_list)
series_from_array = pd.Series(my_array)

In [3]:
series_from_list

0    5.4
1    1.2
2    5.0
3    6.3
4    7.8
dtype: float64

In [4]:
series_from_array

0    5.4
1    1.2
2    5.0
3    6.3
4    7.8
dtype: float64

In [5]:
# we access individual entries the same way as with lists and arrays
print(series_from_array[2])

5.0

In [6]:
# we can add labels to the entries of a series

labels = ['first','second','third','fourth','fifth']
new_series = pd.Series(data=my_list,index=labels)
print(new_series)

first     5.4
second    1.2
third     5.0
fourth    6.3
fifth     7.8
dtype: float64

In [7]:
# we need not be explicit about the entries of pd.Series
new_series1 = pd.Series(my_list,labels)
print(new_series1)

first     5.4
second    1.2
third     5.0
fourth    6.3
fifth     7.8
dtype: float64

In [8]:
# we can also access entries using the index labels
print(new_series1['second'])

1.2

In [9]:
# We can perfrom maths on series 
myseries = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries)
print('')
print(myseries + new_series)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth      9.4
first     10.9
fourth    15.1
second     NaN
third      6.1
dtype: float64

## DataFrames

In [10]:
# We can combine series to create a dataframe using the concat function

concat_df = pd.concat([myseries,new_series],axis=1,sort=False)
concat_df

          0    1
first   5.5  5.4
third   1.1  5.0
fourth  8.8  6.3
fifth   1.6  7.8
second  NaN  1.2

In [11]:
# We can also create Dataframe using the numpy random generators 

rand_df = pd.DataFrame(np.random.randn(5,5))
rand_df

          0         1         2         3         4
0 -0.038904  0.251212 -0.473644  0.042358 -0.592742
1  0.953479 -1.540634  1.657475 -2.109273 -0.633699
2  0.899373  0.471636 -0.921069 -1.127080  1.437970
3 -1.029899 -0.351329 -0.262297  0.142664  1.586718
4 -0.267983 -0.560915 -0.293940 -2.589513  0.050953

In [12]:
# we can also give labels to rows and columns 

rand_df_new = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
rand_df_new

            first col  second col  third col  fourth col  fifth col
first row    0.784425    1.515837   0.853412   -0.322560   0.936113
second row  -0.428655    0.180880  -1.199870    2.098888  -0.693468
third row    2.287805    0.797792  -0.220802    0.821892  -0.496742
fourth row   1.499356    1.227325  -0.443665   -1.236788  -1.595902
fifth row   -1.265473   -0.678655   0.036393   -1.353559   0.644316

In [13]:
# We can access individual series in the Dataframe 

print(rand_df_new['second col'])

first row     1.515837
second row    0.180880
third row     0.797792
fourth row    1.227325
fifth row    -0.678655
Name: second col, dtype: float64

In [14]:
# we can access rows of a dataframe using the loc method 
rand_df_new.loc['fourth row']

first col     1.499356
second col    1.227325
third col    -0.443665
fourth col   -1.236788
fifth col    -1.595902
Name: fourth row, dtype: float64

In [15]:
# we can access rows of a dataframe using the iloc method 
rand_df_new.iloc[2]

first col     2.287805
second col    0.797792
third col    -0.220802
fourth col    0.821892
fifth col    -0.496742
Name: third row, dtype: float64

In [16]:
rand_df_new.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row    1.227325  -0.443665
first row     1.515837   0.853412

In [17]:
# we can use logical indexing for dataframes just like for numpy arrays
rand_df_new>0

            first col  second col  third col  fourth col  fifth col
first row        True        True       True       False       True
second row      False        True      False        True      False
third row        True        True      False        True      False
fourth row       True        True      False       False      False
fifth row       False       False       True       False       True

In [18]:
# we can add columns to a dataframe
rand_df_new['sixth col'] = np.random.randn(5,1)
rand_df_new

            first col  second col  third col  fourth col  fifth col  sixth col
first row    0.784425    1.515837   0.853412   -0.322560   0.936113   0.238082
second row  -0.428655    0.180880  -1.199870    2.098888  -0.693468   1.290884
third row    2.287805    0.797792  -0.220802    0.821892  -0.496742  -0.075205
fourth row   1.499356    1.227325  -0.443665   -1.236788  -1.595902  -0.173783
fifth row   -1.265473   -0.678655   0.036393   -1.353559   0.644316  -0.765571

In [19]:
# we can remove columns or rows from a dataframe
rand_df_new.drop('first col',axis=1,inplace=True)

In [20]:
rand_df_new

            second col  third col  fourth col  fifth col  sixth col
first row     1.515837   0.853412   -0.322560   0.936113   0.238082
second row    0.180880  -1.199870    2.098888  -0.693468   1.290884
third row     0.797792  -0.220802    0.821892  -0.496742  -0.075205
fourth row    1.227325  -0.443665   -1.236788  -1.595902  -0.173783
fifth row    -0.678655   0.036393   -1.353559   0.644316  -0.765571

In [21]:
rand_df_new_1 = rand_df_new.drop('second row',axis=0)
rand_df_new_1

            second col  third col  fourth col  fifth col  sixth col
first row     1.515837   0.853412   -0.322560   0.936113   0.238082
third row     0.797792  -0.220802    0.821892  -0.496742  -0.075205
fourth row    1.227325  -0.443665   -1.236788  -1.595902  -0.173783
fifth row    -0.678655   0.036393   -1.353559   0.644316  -0.765571

In [22]:
# we can remove a dataframe's index labels
rand_df_new_1.reset_index(inplace=True)
rand_df_new_1

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    1.515837   0.853412   -0.322560   0.936113   0.238082
1   third row    0.797792  -0.220802    0.821892  -0.496742  -0.075205
2  fourth row    1.227325  -0.443665   -1.236788  -1.595902  -0.173783
3   fifth row   -0.678655   0.036393   -1.353559   0.644316  -0.765571

In [23]:
# we can assign new names to the index
rand_df_new_1['new name'] = ['This','is','the','row']
rand_df_new_1

,index,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,1.515837,0.853412,-0.322560,0.936113,0.238082,This
1,third row,0.797792,-0.220802,0.821892,-0.496742,-0.075205,is
2,fourth row,1.227325,-0.443665,-1.236788,-1.595902,-0.173783,the
3,fifth row,-0.678655,0.036393,-1.353559,0.644316,-0.765571,row

In [24]:
rand_df_new_1.set_index('new name',inplace=True)
rand_df_new_1

               index  second col  third col  fourth col  fifth col  sixth col
new name
This       first row    1.515837   0.853412   -0.322560   0.936113   0.238082
is         third row    0.797792  -0.220802    0.821892  -0.496742  -0.075205
the       fourth row    1.227325  -0.443665   -1.236788  -1.595902  -0.173783
row        fifth row   -0.678655   0.036393   -1.353559   0.644316  -0.765571

## Combining Dataframes

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

- concat
- join
- merge

### Concat method

In [25]:
df1 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df2 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [26]:
df1

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663

In [27]:
df2

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [28]:
pd.concat([df1,df2],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [29]:
pd.concat([df1,df2],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [30]:
pd.concat([df1,df2],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

### Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [31]:
print(df1)
print(df2)

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663
  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [32]:
# outer merge is union for all the rows and columns of left and right dataframes with Nan when there are no matched values in rows. 

pd.merge(df1,df2,how='outer',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [33]:
# inner merge is the intersection, keeps only the common values in both the left and right dataframes for the merged data.

pd.merge(df1,df2,how='inner',on='customer') # this is the default join of pandas

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [34]:
# right merge keep all the rows in the right dataframe 
pd.merge(df1,df2,how='right',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [35]:
# left merge keep all the rows in the left dataframe 

pd.merge(df1,df2,how='left',on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [36]:
df3 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df4 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [37]:
df3

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [38]:
df4

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [39]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df3.join(df4,how='right') # outer, inner, left, and right work the same as merge

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

## Basic Built-in Methods

In [40]:
df2

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [41]:
# Tell us the unique values in the column

df2['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [42]:
# Tell us the no of unique values in the column

df2['color'].nunique()

3

In [43]:
# value_count tell us the no of times the unique values are present 

df2['color'].value_counts()

green     2
yellow    1
blue      1
Name: color, dtype: int64

In [44]:
df2.mean()

C:\Users\saurava\AppData\Local\Temp\ipykernel_15216\3587575296.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df2.mean()

customer    2.527578e+10
distance    2.150000e+01
sales       3.327500e+02
dtype: float64

In [45]:
new_df = df2[(df2['customer']!='105') & (df2['color']!='green')]
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [46]:
print(df2['sales'].sum())
print(df2['distance'].min())

1331
9

In [47]:
def profit(s):
    return s*0.5 # 50% markup...

In [48]:
df2['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [49]:
df2['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [50]:
df3 = df2[['distance','sales']]
df3.applymap(profit)

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [51]:
def col_sum(co):
    return sum(co)
df3.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [52]:
df2

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [53]:
del df2['color']
df2

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [54]:
df2.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [55]:
df2.sort_values(by='distance',inplace=True)
df2

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [56]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df4 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df4

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [57]:
grouped_data = df4.groupby('customer')
grouped_data

In [58]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577

In [59]:
grouped_data.median()

            product1  product2
customer
Customer 1       1.6      8.65
Customer2        4.0      8.15
Customer3        6.2    513.83

In [60]:
# similar to numpy arrays, we can also save and load dataframes to csv files, and also Excel files

df4.to_csv('df8.csv',index=True)

In [61]:
# read the data 

new_df8 = pd.read_csv('df8.csv',index_col=0)
new_df8

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [62]:
# Writing it to the excel 

df4.to_excel('df8.xlsx',index=False,sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=1)
newer_df8

            customer  product2
product1
1.1       Customer 1      8.20
2.1       Customer 1      9.10
3.8        Customer2     11.10
4.2        Customer2      5.20
5.5        Customer3     44.66
6.9        Customer3    983.00